nrf-rs/nrf-pacs/svds/nrf5340-app.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CACHEINFO_S</name>
      <description>CACHEINFO</description>
      <baseAddress>0x00F08000</baseAddress>
      <headerStructName>CACHEINFO</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CACHEINFO</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>256</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>SET[%s]</name>
          <description>Unspecified</description>
          <headerStructName>CACHEINFO_SET</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0</addressOffset>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>WAY[%s]</name>
            <description>Description collection: Cache information for SET[n], WAY[o].</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>TAG</name>
                <description>Cache tag.</description>
                <lsb>0</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>V</name>
                <description>Valid bit</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Invalid</name>
                    <description>Invalid cache line</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Valid</name>
                    <description>Valid cache line</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MRU</name>
                <description>Most recently used way.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Way0</name>
                    <description>Way0 was most recently used</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Way1</name>
                    <description>Way1 was most recently used</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>FICR_S</name>
      <description>Factory Information Configuration Registers</description>
      <baseAddress>0x00FF0000</baseAddress>
      <headerStructName>FICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>FICR</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>INFO</name>
          <description>Device info</description>
          <headerStructName>FICR_INFO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x200</addressOffset>
          <register>
            <name>CONFIGID</name>
            <description>Configuration identifier</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>HWID</name>
                <description>Identification number for the HW</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DEVICEID[%s]</name>
            <description>Description collection: Device identifier</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>DEVICEID</name>
                <description>64 bit unique device identifier</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PART</name>
            <description>Part code</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00005340</resetValue>
            <fields>
              <field>
                <name>PART</name>
                <description>Part code</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>N5340</name>
                    <description>nRF5340</description>
                    <value>0x5340</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VARIANT</name>
            <description>Part Variant, Hardware version and Production configuration</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>VARIANT</name>
                <description>Part Variant, Hardware version and Production configuration, encoded as ASCII</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>QKAA</name>
                    <description>QKAA</description>
                    <value>0x514B4141</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKAGE</name>
            <description>Package option</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PACKAGE</name>
                <description>Package option</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>QK</name>
                    <description>QKxx - 94-pin aQFN</description>
                    <value>0x2000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RAM</name>
            <description>RAM variant</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>RAM</name>
                <description>RAM variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K16</name>
                    <description>16 kByte RAM</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K32</name>
                    <description>32 kByte RAM</description>
                    <value>0x20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K64</name>
                    <description>64 kByte RAM</description>
                    <value>0x40</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K128</name>
                    <description>128 kByte RAM</description>
                    <value>0x80</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K256</name>
                    <description>256 kByte RAM</description>
                    <value>0x100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K512</name>
                    <description>512 kByte RAM</description>
                    <value>0x200</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH</name>
            <description>Flash variant</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>FLASH</name>
                <description>Flash variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K128</name>
                    <description>128 kByte FLASH</description>
                    <value>0x80</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K256</name>
                    <description>256 kByte FLASH</description>
                    <value>0x100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K512</name>
                    <description>512 kByte FLASH</description>
                    <value>0x200</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K1024</name>
                    <description>1 MByte FLASH</description>
                    <value>0x400</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K2048</name>
                    <description>2 MByte FLASH</description>
                    <value>0x800</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CODEPAGESIZE</name>
            <description>Code memory page size in bytes</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00001000</resetValue>
            <fields>
              <field>
                <name>CODEPAGESIZE</name>
                <description>Code memory page size in bytes</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K4096</name>
                    <description>4 kByte</description>
                    <value>0x1000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CODESIZE</name>
            <description>Code memory size</description>
            <addressOffset>0x024</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000100</resetValue>
            <fields>
              <field>
                <name>CODESIZE</name>
                <description>Code memory size in number of pages</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>P256</name>
                    <description>256 pages</description>
                    <value>256</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVICETYPE</name>
            <description>Device type</description>
            <addressOffset>0x028</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DEVICETYPE</name>
                <description>Device type</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Die</name>
                    <description>Device is an physical DIE</description>
                    <value>0x0000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FPGA</name>
                    <description>Device is an FPGA</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>32</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>TRIMCNF[%s]</name>
          <description>Unspecified</description>
          <headerStructName>FICR_TRIMCNF</headerStructName>
          <access>read-write</access>
          <addressOffset>0x300</addressOffset>
          <register>
            <name>ADDR</name>
            <description>Description cluster: Address of the PAR register which will be written</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <dataType>uint32_t *</dataType>
            <fields>
              <field>
                <name>Address</name>
                <description>Address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA</name>
            <description>Description cluster: Data</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>Data</name>
                <description>Data to be written into the PAR register</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>NFC</name>
          <description>Unspecified</description>
          <headerStructName>FICR_NFC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x450</addressOffset>
          <register>
            <name>TAGHEADER0</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFF5F</resetValue>
            <fields>
              <field>
                <name>MFGID</name>
                <description>Default Manufacturer ID: Nordic Semiconductor ASA has ICM 0x5F</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD1</name>
                <description>Unique identifier byte 1</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD2</name>
                <description>Unique identifier byte 2</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD3</name>
                <description>Unique identifier byte 3</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TAGHEADER1</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>UD4</name>
                <description>Unique identifier byte 4</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD5</name>
                <description>Unique identifier byte 5</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD6</name>
                <description>Unique identifier byte 6</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD7</name>
                <description>Unique identifier byte 7</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TAGHEADER2</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>UD8</name>
                <description>Unique identifier byte 8</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD9</name>
                <description>Unique identifier byte 9</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD10</name>
                <description>Unique identifier byte 10</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD11</name>
                <description>Unique identifier byte 11</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TAGHEADER3</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>UD12</name>
                <description>Unique identifier byte 12</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD13</name>
                <description>Unique identifier byte 13</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD14</name>
                <description>Unique identifier byte 14</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD15</name>
                <description>Unique identifier byte 15</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TRNG90B</name>
          <description>NIST800-90B RNG calibration data</description>
          <headerStructName>FICR_TRNG90B</headerStructName>
          <access>read-write</access>
          <addressOffset>0xC00</addressOffset>
          <register>
            <name>BYTES</name>
            <description>Amount of bytes for the required entropy bits</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000210</resetValue>
            <fields>
              <field>
                <name>BYTES</name>
                <description>Amount of bytes for the required entropy bits</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RCCUTOFF</name>
            <description>Repetition counter cutoff</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>RCCUTOFF</name>
                <description>Repetition counter cutoff</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>APCUTOFF</name>
            <description>Adaptive proportion cutoff</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>APCUTOFF</name>
                <description>Adaptive proportion cutoff</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STARTUP</name>
            <description>Amount of bytes for the startup tests</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>STARTUP</name>
                <description>Amount of bytes for the startup tests</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
