nrf-rs/nrf-pacs/svds/nrf5340-app.svd
          <register>
            <name>ROSC1</name>
            <description>Sample count for ring oscillator 1</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>ROSC1</name>
                <description>Sample count for ring oscillator 1</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ROSC2</name>
            <description>Sample count for ring oscillator 2</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>ROSC2</name>
                <description>Sample count for ring oscillator 2</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ROSC3</name>
            <description>Sample count for ring oscillator 3</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>ROSC3</name>
                <description>Sample count for ring oscillator 3</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ROSC4</name>
            <description>Sample count for ring oscillator 4</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>ROSC4</name>
                <description>Sample count for ring oscillator 4</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>XOSC32MTRIM</name>
          <description>XOSC32M capacitor selection trim values</description>
          <addressOffset>0xC20</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>SLOPE</name>
              <description>Slope trim factor on twos complement form</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>OFFSET</name>
              <description>Offset trim factor on integer form</description>
              <lsb>5</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>UICR_S</name>
      <description>User Information Configuration Registers User information configuration registers</description>
      <baseAddress>0x00FF8000</baseAddress>
      <headerStructName>UICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>UICR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>APPROTECT</name>
          <description>Access port protection</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PALL</name>
              <description>Blocks debugger read/write access to all CPU registers and
          memory mapped addresses.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unprotected</name>
                  <description>Unprotected</description>
                  <value>0x50FA50FA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Protected</name>
                  <description>Protected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VREGHVOUT</name>
          <description>Output voltage from the high voltage (VREGH) regulator stage. The maximum output voltage from this stage is given as VDDH - VREGHDROP.</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>VREGHVOUT</name>
              <description>VREGH regulator output voltage.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1V8</name>
                  <description>1.8 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V1</name>
                  <description>2.1 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V4</name>
                  <description>2.4 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V7</name>
                  <description>2.7 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3V0</name>
                  <description>3.0 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3V3</name>
                  <description>3.3 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default voltage: 1.8 V</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFXOCNT</name>
          <description>HFXO startup counter</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>HFXOCNT</name>
              <description>HFXO startup counter. Total debounce time = HFXOCNT*64 us + 0.5 us</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MinDebounceTime</name>
                  <description>Min debounce time = (0*64 us + 0.5 us)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MaxDebounceTime</name>
                  <description>Max debounce time = (254*64 us + 0.5 us)</description>
                  <value>254</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DefaultDebounceTime</name>
                  <description>Default debounce time for erased UICR = 4*64 us + 0.5 us</description>
                  <value>255</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SECUREAPPROTECT</name>
          <description>Secure access port protection</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PALL</name>
              <description>Blocks debugger read/write access to all secure CPU registers and secure memory
        mapped addresses.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unprotected</name>
                  <description>Unprotected</description>
                  <value>0x50FA50FA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Protected</name>
                  <description>Protected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPROTECT</name>
          <description>Erase protection</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PALL</name>
              <description>Blocks NVMC ERASEALL and CTRLAP ERASEALL functionality. Using any value except Unprotected will lead to the protection being enabled.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unprotected</name>
                  <description>Unprotected</description>
                  <value>0xFFFFFFFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Protected</name>
                  <description>Protected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TINSTANCE</name>
          <description>SW-DP Target instance</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>TINSTANCE</name>
              <description>TINSTANCE bits are negated and used in the SW-DP DLPIDR.TINSTANCE field. E.g. 0xF in this field is translated to 0x0 in DLPIDR.TINSTANCE field.</description>
              <lsb>28</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>NFCPINS</name>
          <description>Setting of pins dedicated to NFC functionality: NFC antenna or GPIO</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PROTECT</name>
              <description>Setting of pins dedicated to NFC functionality</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Operation as GPIO pins. Same protection as normal GPIO pins</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NFC</name>
                  <description>Operation as NFC antenna pins. Configures the protection for NFC operation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0xC0</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>OTP[%s]</name>
          <description>Description collection: One time programmable memory</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>LOWER</name>
              <description>Lower half word</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>UPPER</name>
              <description>Upper half word</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-writeOnce</access>
            </field>
          </fields>
        </register>
        <cluster>
          <name>KEYSLOT</name>
          <description>Unspecified</description>
          <headerStructName>UICR_KEYSLOT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <cluster>
            <dim>128</dim>
            <dimIncrement>0x008</dimIncrement>
            <name>CONFIG[%s]</name>
            <description>Unspecified</description>
            <headerStructName>UICR_KEYSLOT_CONFIG</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>DEST</name>
              <description>Description cluster: Destination address where content of the key value registers (KEYSLOT.KEYn.VALUE[0-3])
          will be pushed by KMU. Note that this address must match that of a peripherals
          APB mapped write-only key registers, else the KMU can push this key value into
          an address range which the CPU can potentially read.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>DEST</name>
                  <description>Secure APB destination address</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PERM</name>
              <description>Description cluster: Define permissions for the key slot. Bits 0-15 and 16-31 can only be written when equal to 0xFFFF.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>WRITE</name>
                  <description>Write permission for key slot</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable write to the key value registers</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable write to the key value registers</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>READ</name>
                  <description>Read permission for key slot</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable read from key value registers</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable read from key value registers</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>PUSH</name>
                  <description>Push permission for key slot</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable pushing of key value registers over secure APB, but can be read if field READ is Enabled</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable pushing of key value registers over secure APB. Register KEYSLOT.CONFIGn.DEST must contain a valid destination address!</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STATE</name>
                  <description>Revocation state for the key slot</description>
                  <lsb>16</lsb>
                  <msb>16</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Revoked</name>
                      <description>Key value registers can no longer be read or pushed</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Active</name>
                      <description>Key value registers are readable (if enabled) and can be pushed (if enabled)</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>128</dim>
            <dimIncrement>0x010</dimIncrement>
            <name>KEY[%s]</name>
            <description>Unspecified</description>
            <headerStructName>UICR_KEYSLOT_KEY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x400</addressOffset>
            <register>
              <dim>0x4</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>VALUE[%s]</name>
              <description>Description collection: Define bits [31+o*32:0+o*32] of value assigned to KMU key slot.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Define bits [31+o*32:0+o*32] of value assigned to KMU key slot</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
