nrf-rs/nrf-pacs/svds/nrf5340-app.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="DCNF_NS">
      <name>DCNF_S</name>
      <description>Domain configuration management 1</description>
      <baseAddress>0x50000000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="FPU_NS">
      <name>FPU_S</name>
      <description>FPU control peripheral 1</description>
      <baseAddress>0x50000000</baseAddress>
      <alternatePeripheral>DCNF_S</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>FPU</name>
        <value>0</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>CACHE_S</name>
      <description>Cache</description>
      <baseAddress>0x50001000</baseAddress>
      <headerStructName>CACHE</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CACHE</name>
        <value>1</value>
      </interrupt>
      <groupName>CACHE</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x020</dimIncrement>
          <name>PROFILING[%s]</name>
          <description>Unspecified</description>
          <headerStructName>CACHE_PROFILING</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>IHIT</name>
            <description>Description cluster: Instruction fetch cache hit counter for cache region n, where n=0 means Flash and n=1 means XIP.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>HITS</name>
                <description>Number of instruction cache hits</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IMISS</name>
            <description>Description cluster: Instruction fetch cache miss counter for cache region n, where n=0 means Flash and n=1 means XIP.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>MISSES</name>
                <description>Number of instruction cache misses</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DHIT</name>
            <description>Description cluster: Data fetch cache hit counter for cache region n, where n=0 means Flash and n=1 means XIP.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>HITS</name>
                <description>Number of data cache hits</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DMISS</name>
            <description>Description cluster: Data fetch cache miss counter for cache region n, where n=0 means Flash and n=1 means XIP.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>MISSES</name>
                <description>Number of data cache misses</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>ENABLE</name>
          <description>Enable cache.</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable cache</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable cache</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INVALIDATE</name>
          <description>Invalidate the cache.</description>
          <addressOffset>0x504</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>INVALIDATE</name>
              <description>Invalidate the cache</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Invalidate</name>
                  <description>Invalidate the cache</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASE</name>
          <description>Erase the cache.</description>
          <addressOffset>0x508</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ERASE</name>
              <description>Erase the cache</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Erase</name>
                  <description>Erase cache</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PROFILINGENABLE</name>
          <description>Enable the profiling counters.</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable the profiling counters</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable profiling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable profiling</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PROFILINGCLEAR</name>
          <description>Clear the profiling counters.</description>
          <addressOffset>0x510</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>CLEAR</name>
              <description>Clearing the profiling counters</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear the profiling counters</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Cache mode. Switching from Cache to Ram mode causes the RAM to be cleared. Switching from RAM to Cache mode causes the cache to be invalidated.</description>
          <addressOffset>0x514</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODE</name>
              <description>Cache mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Cache</name>
                  <description>Cache mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ram</name>
                  <description>RAM mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUGLOCK</name>
          <description>Lock debug mode.</description>
          <addressOffset>0x518</addressOffset>
          <access>read-writeOnce</access>
          <fields>
            <field>
              <name>DEBUGLOCK</name>
              <description>Lock debug mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Debug mode unlocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Debug mode locked</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASESTATUS</name>
          <description>Cache erase status.</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERASESTATUS</name>
              <description>Cache erase status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>Erase is not complete or hasn't started</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Finished</name>
                  <description>Cache erase is finished</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITELOCK</name>
          <description>Lock cache updates. Prevents updating of cache content on cache misses, but will continue to lookup instruction/data fetches in content already present in the cache. Ignored in RAM mode.</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>WRITELOCK</name>
              <description>Lock cache updates</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Cache updates unlocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Cache updates locked</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
