nrf-rs/nrf-pacs/svds/nrf5340-app.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="CLOCK_NS">
      <name>CLOCK_S</name>
      <description>Clock management 1</description>
      <baseAddress>0x50005000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>CLOCK_POWER</name>
        <value>5</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="POWER_NS">
      <name>POWER_S</name>
      <description>Power control 1</description>
      <baseAddress>0x50005000</baseAddress>
      <alternatePeripheral>CLOCK_S</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>CLOCK_POWER</name>
        <value>5</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="RESET_NS">
      <name>RESET_S</name>
      <description>Reset control 1</description>
      <baseAddress>0x50005000</baseAddress>
      <alternatePeripheral>CLOCK_S</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>CTRLAP_NS</name>
      <description>Control access port 0</description>
      <baseAddress>0x40006000</baseAddress>
      <headerStructName>CTRLAPPERI</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CTRLAPPERI</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>MAILBOX</name>
          <description>Unspecified</description>
          <headerStructName>CTRLAPPERI_MAILBOX</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>RXDATA</name>
            <description>Data sent from the debugger to the CPU.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RXDATA</name>
                <description>Data received from debugger</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXSTATUS</name>
            <description>This register shows a status that indicates if data sent from the debugger to the CPU has been read.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RXSTATUS</name>
                <description>Status of data in register RXDATA</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoDataPending</name>
                    <description>No data pending in register RXDATA</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DataPending</name>
                    <description>Data pending in register RXDATA</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TXDATA</name>
            <description>Data sent from the CPU to the debugger.</description>
            <addressOffset>0x80</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>TXDATA</name>
                <description>Data sent to debugger</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXSTATUS</name>
            <description>This register shows a status that indicates if the data sent from the CPU to the debugger has been read.</description>
            <addressOffset>0x84</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>TXSTATUS</name>
                <description>Status of data in register TXDATA</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoDataPending</name>
                    <description>No data pending in register TXDATA</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DataPending</name>
                    <description>Data pending in register TXDATA</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>ERASEPROTECT</name>
          <description>Unspecified</description>
          <headerStructName>CTRLAPPERI_ERASEPROTECT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>LOCK</name>
            <description>This register locks the ERASEPROTECT.DISABLE register from being written until next reset.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeOnce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LOCK</name>
                <description>Lock ERASEPROTECT.DISABLE register from being written until next reset</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>Register ERASEPROTECT.DISABLE is writeable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>Register ERASEPROTECT.DISABLE is read-only</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DISABLE</name>
            <description>This register disables the ERASEPROTECT register and performs an  ERASEALL operation.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-writeOnce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY</name>
                <description>The ERASEALL sequence is initiated if the value of the KEY fields are non-zero and the KEY fields match on both the CPU and debugger sides.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>APPROTECT</name>
          <description>Unspecified</description>
          <headerStructName>CTRLAPPERI_APPROTECT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x540</addressOffset>
          <register>
            <name>LOCK</name>
            <description>This register locks the APPROTECT.DISABLE register from being written to until next reset.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeOnce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LOCK</name>
                <description>Lock the APPROTECT.DISABLE register from being written to until next reset</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>Register APPROTECT.DISABLE is writeable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>Register APPROTECT.DISABLE is read-only</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DISABLE</name>
            <description>This register disables the APPROTECT register and enables debug access to non-secure mode.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY</name>
                <description>If the value of the KEY field is non-zero, and the KEY fields match on both the
        CPU and debugger sides, disable APPROTECT and enable debug access to non-secure mode until
        the next pin reset, brown-out reset, power-on reset, or watchog timer reset. After reset the debugger side register has a fixed KEY value. To enable debug access, both CTRL-AP and UICR.APPROTECT protection needs to be disabled.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>SECUREAPPROTECT</name>
          <description>Unspecified</description>
          <headerStructName>CTRLAPPERI_SECUREAPPROTECT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x548</addressOffset>
          <register>
            <name>LOCK</name>
            <description>This register locks the SECUREAPPROTECT.DISABLE register from being written until next reset.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeOnce</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>LOCK</name>
                <description>Lock register SECUREAPPROTECT.DISABLE from being written until next reset</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>Register SECUREAPPROTECT.DISABLE is writeable</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>Register SECUREAPPROTECT.DISABLE is read-only</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DISABLE</name>
            <description>This register disables the SECUREAPPROTECT register and enables debug access to secure mode.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY</name>
                <description>If the value of the KEY field is non-zero, and the KEY fields match on both the
        CPU and debugger sides, disable SECUREAPPROTECT and enable debug access to secure mode until
        the next pin reset, brown-out reset, power-on reset, or watchog timer reset. After reset the debugger side register has a fixed KEY value. To enable debug access, both CTRL-AP and UICR.SECUREAPPROTECT protection needs to be disabled.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>STATUS</name>
          <description>Status bits for CTRL-AP peripheral.</description>
          <addressOffset>0x600</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UICRAPPROTECT</name>
              <description>Status bit for UICR part of access port protection at last reset.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>APPROTECT was enabled in UICR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>APPROTECT wasdisabled in UICR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UICRSECUREAPPROTECT</name>
              <description>Status bit for UICR part of secure access port protection at last reset.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>SECUREAPPROTECT was enabled in UICR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>SECUREAPPROTECT was disabled in UICR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGIFACEMODE</name>
              <description>Status bit for device debug interface mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No debugger attached</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debugger is attached and device is in debug interface mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
