nrf-rs/nrf-pacs/svds/nrf5340-app.svd
        <register>
          <name>PUBLISH_STOPPED</name>
          <description>Publish configuration for event STOPPED</description>
          <addressOffset>0x190</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event STOPPED will publish to.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHORTS</name>
          <description>Shortcuts between local events and tasks</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>REPORTRDY_READCLRACC</name>
              <description>Shortcut between event REPORTRDY and task READCLRACC</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLERDY_STOP</name>
              <description>Shortcut between event SAMPLERDY and task STOP</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPORTRDY_RDCLRACC</name>
              <description>Shortcut between event REPORTRDY and task RDCLRACC</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPORTRDY_STOP</name>
              <description>Shortcut between event REPORTRDY and task STOP</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBLRDY_RDCLRDBL</name>
              <description>Shortcut between event DBLRDY and task RDCLRDBL</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBLRDY_STOP</name>
              <description>Shortcut between event DBLRDY and task STOP</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLERDY_READCLRACC</name>
              <description>Shortcut between event SAMPLERDY and task READCLRACC</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable shortcut</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable shortcut</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMPLERDY</name>
              <description>Write '1' to enable interrupt for event SAMPLERDY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPORTRDY</name>
              <description>Write '1' to enable interrupt for event REPORTRDY</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCOF</name>
              <description>Write '1' to enable interrupt for event ACCOF</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBLRDY</name>
              <description>Write '1' to enable interrupt for event DBLRDY</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPPED</name>
              <description>Write '1' to enable interrupt for event STOPPED</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMPLERDY</name>
              <description>Write '1' to disable interrupt for event SAMPLERDY</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPORTRDY</name>
              <description>Write '1' to disable interrupt for event REPORTRDY</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCOF</name>
              <description>Write '1' to disable interrupt for event ACCOF</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBLRDY</name>
              <description>Write '1' to disable interrupt for event DBLRDY</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPPED</name>
              <description>Write '1' to disable interrupt for event STOPPED</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>Enable the quadrature decoder</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable the quadrature decoder</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LEDPOL</name>
          <description>LED output pin polarity</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>LEDPOL</name>
              <description>LED output pin polarity</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ActiveLow</name>
                  <description>Led active on output pin low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ActiveHigh</name>
                  <description>Led active on output pin high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPLEPER</name>
          <description>Sample period</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMPLEPER</name>
              <description>Sample period. The SAMPLE register will be updated for every new sample</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>128us</name>
                  <description>128 us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256us</name>
                  <description>256 us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512us</name>
                  <description>512 us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024us</name>
                  <description>1024 us</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2048us</name>
                  <description>2048 us</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4096us</name>
                  <description>4096 us</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8192us</name>
                  <description>8192 us</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16384us</name>
                  <description>16384 us</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32ms</name>
                  <description>32768 us</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>65ms</name>
                  <description>65536 us</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>131ms</name>
                  <description>131072 us</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPLE</name>
          <description>Motion sample value</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-only</access>
          <dataType>int32_t</dataType>
          <fields>
            <field>
              <name>SAMPLE</name>
              <description>Last motion sample</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
