nrf-rs/nrf-pacs/svds/nrf5340-app.svd
        <register>
          <name>REPORTPER</name>
          <description>Number of samples to be taken before REPORTRDY and DBLRDY events can be generated</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>REPORTPER</name>
              <description>Specifies the number of samples to be accumulated in the ACC register before the REPORTRDY and DBLRDY events can be generated.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>10Smpl</name>
                  <description>10 samples/report</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40Smpl</name>
                  <description>40 samples/report</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>80Smpl</name>
                  <description>80 samples/report</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>120Smpl</name>
                  <description>120 samples/report</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>160Smpl</name>
                  <description>160 samples/report</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>200Smpl</name>
                  <description>200 samples/report</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>240Smpl</name>
                  <description>240 samples/report</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>280Smpl</name>
                  <description>280 samples/report</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1Smpl</name>
                  <description>1 sample/report</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC</name>
          <description>Register accumulating the valid transitions</description>
          <addressOffset>0x514</addressOffset>
          <access>read-only</access>
          <dataType>int32_t</dataType>
          <fields>
            <field>
              <name>ACC</name>
              <description>Register accumulating all valid samples (not double transition) read from the SAMPLE register.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCREAD</name>
          <description>Snapshot of the ACC register, updated by the READCLRACC or RDCLRACC task</description>
          <addressOffset>0x518</addressOffset>
          <access>read-only</access>
          <dataType>int32_t</dataType>
          <fields>
            <field>
              <name>ACCREAD</name>
              <description>Snapshot of the ACC register.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>QDEC_PSEL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x51C</addressOffset>
          <register>
            <name>LED</name>
            <description>Pin select for LED signal</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>A</name>
            <description>Pin select for A signal</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>B</name>
            <description>Pin select for B signal</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>DBFEN</name>
          <description>Enable input debounce filters</description>
          <addressOffset>0x528</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DBFEN</name>
              <description>Enable input debounce filters</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Debounce input filters disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debounce input filters enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LEDPRE</name>
          <description>Time period the LED is switched ON prior to sampling</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>LEDPRE</name>
              <description>Period in us the LED is switched on prior to sampling</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCDBL</name>
          <description>Register accumulating the number of detected double transitions</description>
          <addressOffset>0x544</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ACCDBL</name>
              <description>Register accumulating the number of detected double or illegal transitions. ( SAMPLE = 2 ).</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCDBLREAD</name>
          <description>Snapshot of the ACCDBL, updated by the READCLRACC or RDCLRDBL task</description>
          <addressOffset>0x548</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ACCDBLREAD</name>
              <description>Snapshot of the ACCDBL register. This field is updated when the READCLRACC or RDCLRDBL task is triggered.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
