nrf-rs/nrf-pacs/svds/nrf5340-app.svd
        <register>
          <name>ENABLE</name>
          <description>Enable USB</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable USB</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>USB peripheral is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>USB peripheral is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USBPULLUP</name>
          <description>Control of the USB pull-up</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONNECT</name>
              <description>Control of the USB pull-up on the D+ line</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Pull-up is disconnected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Pull-up is connected to D+</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DPDMVALUE</name>
          <description>State D+ and D- lines will be forced into by the DPDMDRIVE task. The DPDMNODRIVE task reverts the control of the lines to MAC IP (no forcing).</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>STATE</name>
              <description>State D+ and D- lines will be forced into by the DPDMDRIVE task</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Resume</name>
                  <description>D+ forced low, D- forced high (K state) for a timing preset in hardware (50 us or 5 ms, depending on bus state)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>J</name>
                  <description>D+ forced high, D- forced low (J state)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K</name>
                  <description>D+ forced low, D- forced high (K state)</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DTOGGLE</name>
          <description>Data toggle control and status</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>EP</name>
              <description>Select bulk endpoint number</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>IO</name>
              <description>Selects IN or OUT endpoint</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Out</name>
                  <description>Selects OUT endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>In</name>
                  <description>Selects IN endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALUE</name>
              <description>Data toggle value</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Nop</name>
                  <description>No action on data toggle when writing the register with this value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Data0</name>
                  <description>Data toggle is DATA0 on endpoint set by EP and IO</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Data1</name>
                  <description>Data toggle is DATA1 on endpoint set by EP and IO</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EPINEN</name>
          <description>Endpoint IN enable</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>IN0</name>
              <description>Enable IN endpoint 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint IN 0 (no response to IN tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint IN 0 (response to IN tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN1</name>
              <description>Enable IN endpoint 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint IN 1 (no response to IN tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint IN 1 (response to IN tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN2</name>
              <description>Enable IN endpoint 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint IN 2 (no response to IN tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint IN 2 (response to IN tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN3</name>
              <description>Enable IN endpoint 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint IN 3 (no response to IN tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint IN 3 (response to IN tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN4</name>
              <description>Enable IN endpoint 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint IN 4 (no response to IN tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint IN 4 (response to IN tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN5</name>
              <description>Enable IN endpoint 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint IN 5 (no response to IN tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint IN 5 (response to IN tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN6</name>
              <description>Enable IN endpoint 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint IN 6 (no response to IN tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint IN 6 (response to IN tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IN7</name>
              <description>Enable IN endpoint 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint IN 7 (no response to IN tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint IN 7 (response to IN tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISOIN</name>
              <description>Enable ISO IN endpoint</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable ISO IN endpoint 8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable ISO IN endpoint 8</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EPOUTEN</name>
          <description>Endpoint OUT enable</description>
          <addressOffset>0x514</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>OUT0</name>
              <description>Enable OUT endpoint 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint OUT 0 (no response to OUT tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint OUT 0 (response to OUT tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT1</name>
              <description>Enable OUT endpoint 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint OUT 1 (no response to OUT tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint OUT 1 (response to OUT tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT2</name>
              <description>Enable OUT endpoint 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint OUT 2 (no response to OUT tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint OUT 2 (response to OUT tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT3</name>
              <description>Enable OUT endpoint 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint OUT 3 (no response to OUT tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint OUT 3 (response to OUT tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT4</name>
              <description>Enable OUT endpoint 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint OUT 4 (no response to OUT tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint OUT 4 (response to OUT tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT5</name>
              <description>Enable OUT endpoint 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint OUT 5 (no response to OUT tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint OUT 5 (response to OUT tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT6</name>
              <description>Enable OUT endpoint 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint OUT 6 (no response to OUT tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint OUT 6 (response to OUT tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT7</name>
              <description>Enable OUT endpoint 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable endpoint OUT 7 (no response to OUT tokens)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable endpoint OUT 7 (response to OUT tokens)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISOOUT</name>
              <description>Enable ISO OUT endpoint 8</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable ISO OUT endpoint 8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable ISO OUT endpoint 8</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EPSTALL</name>
          <description>STALL endpoints</description>
          <addressOffset>0x518</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>EP</name>
              <description>Select endpoint number</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>IO</name>
              <description>Selects IN or OUT endpoint</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Out</name>
                  <description>Selects OUT endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>In</name>
                  <description>Selects IN endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STALL</name>
              <description>Stall selected endpoint</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UnStall</name>
                  <description>Don't stall selected endpoint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stall</name>
                  <description>Stall selected endpoint</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISOSPLIT</name>
          <description>Controls the split of ISO buffers</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPLIT</name>
              <description>Controls the split of ISO buffers</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OneDir</name>
                  <description>Full buffer dedicated to either ISO IN or OUT</description>
                  <value>0x0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HalfIN</name>
                  <description>Lower half for IN, upper half for OUT</description>
                  <value>0x0080</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAMECNTR</name>
          <description>Returns the current value of the start of frame counter</description>
          <addressOffset>0x520</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>FRAMECNTR</name>
              <description>Returns the current value of the start of frame counter</description>
              <lsb>0</lsb>
              <msb>10</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LOWPOWER</name>
          <description>Controls USBD peripheral low power mode during USB suspend</description>
          <addressOffset>0x52C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOWPOWER</name>
              <description>Controls USBD peripheral low-power mode during USB suspend</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ForceNormal</name>
                  <description>Software must write this value to exit low power mode and before performing a remote wake-up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LowPower</name>
                  <description>Software must write this value to enter low power mode after DMA and software have finished interacting with the USB peripheral</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
